# SQL Tutorial: PostgreSQL & MySQL #

In this tutorial, I will cover some of the basics of SQL. I will primarily use PostgreSQL, but I will also demonstrate the equivalent MySQL code. 
For this purpose, I use an already existing database.

**Note:** Throughout this tutorial, you will find `%%sql` at the beginning of each code snippet. This prefix is a "magic command" used specifically to enable SQL support within Jupyter Notebooks. When running these queries in a standard SQL editor (such as pgAdmin or MySQL Workbench), simply omit this line and start directly with the SQL statement (e.g., `SELECT`...).

In [6]:
# Setup existing local DB
import os
from dotenv import load_dotenv
import sqlalchemy

load_dotenv(override=True)

user = os.getenv('DB_USER')
pw = os.getenv('DB_PASSWORD')
host = os.getenv('DB_HOST')
port = os.getenv('DB_PORT')
db = os.getenv('DB_NAME')

connection_url = f"postgresql://{user}:{pw}@{host}:{port}/{db}"
engine = sqlalchemy.create_engine(connection_url)
%sql engine

## Querying Data ##

### SELECT ###

The `SELECT` statement is the foundation of SQL. It allows you to retrieve specific data from one or more tables. While the basic syntax is almost identical in **PostgreSQL** and **MySQL**, it is important to understand how each system handles result sets in order to become proficient with databases.

**Key Concepts:**
* **The Wildcard (`*`):** Used to retrieve all columns from a table.
* **Column Selection:** Specifying exact column names for better performance and clarity.
* **LIMIT vs. FETCH:** Controlling how many rows are returned (especially useful for large datasets).

#### The "Select All" Query
The most basic way to retrieve data is to ask the database for every single column and row within a table. To do this, we use the `SELECT` statement combined with the asterisk (`*`) wildcard.

* **SELECT**: Tells the database which columns you want to see.
* **Asterisk (*)**: A wildcard that represents "all columns."
* **FROM**: Specifies the table where the data is stored.

In [7]:
%%sql 
# PostgreSQL & MySQL
SELECT * FROM customers

Running query in 'postgresql://postgres:***@localhost:5432/Bookstore'

200 rows affected.

+----+------------+-----------+------------+-----------------------------+------------------------+------------------------+-----+
| id |   title    | firstname |  lastname  |            street           |          city          |         email          | age |
+----+------------+-----------+------------+-----------------------------+------------------------+------------------------+-----+
| 1  |  Frau Dr.  |    Dana   |    Mai     |          Roseweg 81         |         Brilon         |    otto77@gmail.com    |  58 |
| 2  |  Herr Dr.  |    Gaby   |  Heinrich  |     Ahmet-Wolf-Platz 12     |       Neumünster       | konstantin.blum@gmx.de |  74 |
| 3  |    Herr    |   Simon   |  Behrens   |        Hechtstraße 4        |        Arnstadt        | heinzjoachim60@aol.de  |  68 |
| 4  |    Frau    |  Meinolf  |    Kolb    | Benedikt-Wiedemann-Gasse 8c |    Bernburg (Saale)    |   paul67@t-online.de   |  43 |
| 5  | Frau Prof. |  Waldemar | Gottschalk |    Lisbeth-Hagen-Ring 0b    |   Lohne (Oldenburg)    | gertraude.funke@aol.de |  30 |
| 6  |    Herr    |   Valeri  |   Stumpf   |        Krebsallee 90a       |         Mainz          |   hvetter@hotmail.de   |  67 |
| 7  | Frau Prof. |   Gitta   |   Strauß   |     Fleischmanngasse 766    |       Metzingen        | rsauer@googlemail.com  |  79 |
| 8  | Herr Prof. |  Wolfgang |   Reimer   |       Neubertplatz 15a      |        Detmold         |  ursula38@freenet.de   |  51 |
| 9  |    Frau    |    Lina   |  Springer  |         Auerstraße 5        |        Duisburg        |      wmarx@gmx.de      |  31 |
| 10 |    Herr    |  Hartmut  |  Fröhlich  |  Wenzel-Beckmann-Gasse 02c  | Weilheim in Oberbayern |    yriedel@mail.de     |  77 |
+----+------------+-----------+------------+-----------------------------+------------------------+------------------------+-----+
Truncated to displaylimit of 10.

#### Selecting Specific Columns
In most real-world scenarios, you don't need every single column from a table. Fetching only the data you actually need reduces the load on the database and speeds up your application. 

To select specific columns, simply replace the asterisk (`*`) with a comma-separated list of the column names you wish to retrieve.

**Why use specific columns instead of `SELECT *`?**
* **Performance:** Less data is transferred over the network.
* **Clarity:** It makes your code easier to read for other developers.
* **Stability:** If a new column is added to the table later, your query won't be affected by unexpected extra data.

In [ ]:
%%sql
#Selecting only the name and email of each customer

#PostgreSQL & MySQL
SELECT firstname, lastname, email FROM customers;

Running query in 'postgresql://postgres:***@localhost:5432/Bookstore'

200 rows affected.

+-----------+------------+------------------------+
| firstname |  lastname  |         email          |
+-----------+------------+------------------------+
|    Dana   |    Mai     |    otto77@gmail.com    |
|    Gaby   |  Heinrich  | konstantin.blum@gmx.de |
|   Simon   |  Behrens   | heinzjoachim60@aol.de  |
|  Meinolf  |    Kolb    |   paul67@t-online.de   |
|  Waldemar | Gottschalk | gertraude.funke@aol.de |
|   Valeri  |   Stumpf   |   hvetter@hotmail.de   |
|   Gitta   |   Strauß   | rsauer@googlemail.com  |
|  Wolfgang |   Reimer   |  ursula38@freenet.de   |
|    Lina   |  Springer  |      wmarx@gmx.de      |
|  Hartmut  |  Fröhlich  |    yriedel@mail.de     |
+-----------+------------+------------------------+
Truncated to displaylimit of 10.

#### Quoting Identifiers: PostgreSQL vs. MySQL

Sometimes, table or column names might contain spaces, special characters, or match a reserved SQL keyword (like `Order` or `User`). To handle this, each system uses its own "quoting" style:

* **PostgreSQL** uses **Double Quotes**:        `"First Name"`
* **MySQL** uses **Backticks**:               `` `First Name` ``
* **MS SQL Server** uses **Square Brackets**:   `[First Name]`


> **Note on Case Sensitivity:** 
> In **PostgreSQL**, unquoted names are automatically folded to lowercase. If you created a table named `Customers` (capital C), Postgres will look for `customers` unless you use `"Customers"`.
> In **MySQL**, case sensitivity often depends on the underlying operating system, but typically, backticks are used to avoid conflicts with keywords.

In [ ]:
%%sql
# Using double quotes in Postgres
SELECT "firstname", "email" FROM customers;

# Using backticks in MySQL
SELECT `firstname`, `email` FROM customers;

Running query in 'postgresql://postgres:***@localhost:5432/Bookstore'

200 rows affected.

+-----------+------------------------+
| firstname |         email          |
+-----------+------------------------+
|    Dana   |    otto77@gmail.com    |
|    Gaby   | konstantin.blum@gmx.de |
|   Simon   | heinzjoachim60@aol.de  |
|  Meinolf  |   paul67@t-online.de   |
|  Waldemar | gertraude.funke@aol.de |
|   Valeri  |   hvetter@hotmail.de   |
|   Gitta   | rsauer@googlemail.com  |
|  Wolfgang |  ursula38@freenet.de   |
|    Lina   |      wmarx@gmx.de      |
|  Hartmut  |    yriedel@mail.de     |
+-----------+------------------------+
Truncated to displaylimit of 10.

#### Pro-Tip: To Quote or Not to Quote?

While using identifiers like `"column"` (Postgres) or `` `column` `` (MySQL) ensures your query always works, the **industry best practice** is to avoid them whenever possible by following these naming conventions:

1. **Use snake_case:** Use `customer_id` instead of `"Customer ID"`.
2. **Stick to lowercase:** Especially in PostgreSQL, this avoids confusion with case-sensitivity.
3. **Avoid Reserved Words:** Try not to name your columns `Table`, `Select`, or `User`.

**Verdict:** Only use quotes/backticks if you are forced to work with a database schema that already contains spaces or reserved keywords. Clean naming makes your SQL code more portable and much easier to read!

### WHERE ###

Filtering Data: The `WHERE` clause is used to extract only those records that fulfill a specified condition. This is essential for navigating large databases efficiently.
<br>
<br>
<br>
**Basic Syntax:**
```sql
SELECT column1, column2
FROM table_name
WHERE condition;

The "Case-Sensitivity" Trap: Postgres vs. MySQL <br>
This is one of the most significant differences you will encounter in daily work:

PostgreSQL is CASE-SENSITIVE: Searching for 'John' will not find 'john'. You must match the casing exactly or use specific operators like ILIKE.

MySQL is CASE-INSENSITIVE (usually): By default, searching for 'John' will also find 'john' or 'JOHN'. This depends on the "collation" settings of the database, but most standard setups behave this way.

In [ ]:
# We are searching for a customer with a specific name. Please note that text values in SQL are always enclosed in single quotation marks (`'`).

%%sql
SELECT firstname, lastname FROM customers
WHERE firstname = 'Anne'

Running query in 'postgresql://postgres:***@localhost:5432/Bookstore'

1 rows affected.

+-----------+----------+
| firstname | lastname |
+-----------+----------+
|    Anne   |  Bruns   |
+-----------+----------+

#### Common Operators

You can use more than just the equals sign (`=`). Here are the most common operators available in both systems:

| Operator | Description | Example |
| :--- | :--- | :--- |
| `=` | Equal to | `WHERE age = 25` |
| `!=` or `<>` | Not equal to | `WHERE city <> 'Berlin'` |
| `>` / `<` | Greater / Less than | `WHERE price > 19.99` |
| `>=` / `<=` | Greater / Less or equal | `WHERE stock >= 10` |
| `BETWEEN` | Within a range | `WHERE id BETWEEN 10 AND 20` |
| `IN` | Matches any value in a list | `WHERE country IN ('DE', 'AT', 'CH')` |

#### Pattern Matching with Wildcards (`LIKE`)

Sometimes you don't need an exact match, but rather a way to find data that fits a certain pattern. This is where the `LIKE` operator and **wildcards** come in:

* **`%` (Percent Sign):** Represents zero, one, or multiple characters.
* **`_` (Underscore):** Represents exactly one single character.

| Filter | Meaning |
| :--- | :--- |
| `WHERE name LIKE 'A%'` | Starts with "A" |
| `WHERE name LIKE '%son'` | Ends with "son" |
| `WHERE name LIKE '%ma%'` | Contains "ma" anywhere |
| `WHERE code LIKE 'A_1'` | Starts with A, then any char, then 1 (e.g., "A11", "AB1") |

---

#### ⚠️ The Postgres vs. MySQL Difference (Important!)

* **PostgreSQL** is **case-sensitive** for `LIKE`. Searching for `'a%'` will NOT find 'Alice'. 
  * *Solution:* Use **`ILIKE`** (the "I" stands for Insensitive) in Postgres for case-insensitive matching.
* **MySQL** is **case-insensitive** by default for `LIKE`. Searching for `'a%'` will find 'Alice'.

In [11]:
%%sql
# Using ILIKE (Postgres specific) to find all names starting with 'a' 
# regardless of whether they are uppercase or lowercase.
SELECT firstname, lastname FROM customers
WHERE firstname ILIKE 'a%';

Running query in 'postgresql://postgres:***@localhost:5432/Bookstore'

18 rows affected.

+-----------+-----------+
| firstname |  lastname |
+-----------+-----------+
|   Alwin   |  Brunner  |
|    Anne   |   Bruns   |
|   Albert  | Fleischer |
|    Anke   |   Hesse   |
| Annemarie |  Seifert  |
|   Ahmet   |   Kröger  |
|  Annelies |   Weiss   |
| Anneliese |  Steffen  |
|   Anita   |   Lange   |
|    Arno   |   Zander  |
+-----------+-----------+
Truncated to displaylimit of 10.